from aiogram import Bot, types, Dispatcher
from aiogram.utils import executor, callback_data

bot = Bot(token="6962115781:AAE9eORXE7r2wrrFiuHQ5PlRUL0PLgFF0MQ")
dp = Dispatcher(bot)
question1 = "У якому розмірі виплачується грошова компенсація за піднайом (налом) житла?"
question2 = "Як розраховується кількість кімнат в належному для отримання житловому приміщенні?"
question3 = "Які документи необхідно подати для постанови на чергу на отримання житлового приміщення?"
question4 = "Які документи необхідно зібрати для отримання грошової компенсації на піднайом (найом) житлових приміщень?"
question5 = "У якому випадку особи знімаються з обліку військовослужбовців, які потребують покращення житлових умов?"

@dp.message_handler(commands=["start"])
async def start(message: types.Message):
    begin = types.KeyboardButton("📲Розпочати")
    mar = types.ReplyKeyboardMarkup(resize_keyboard=True).add(begin)
    await bot.send_message(message.from_user.id, "👋🏻Вас вітає бот «DreamDim».\n\n"
                                                 "Цей бот дасть відповіді на найпоширеніші запитання щодо квартирної черги.", reply_markup=mar)


@dp.message_handler(text="📲Розпочати")
@dp.message_handler(text="Назад🔙")
async def questions_menu(message: types.Message):
    first = types.KeyboardButton("Питання 1")
    second = types.KeyboardButton("Питання 2")
    third = types.KeyboardButton("Питання 3")
    fourth = types.KeyboardButton("Питання 4")
    fiveth = types.KeyboardButton("Питання 5")
    mar = types.ReplyKeyboardMarkup(resize_keyboard=True).add(first, second, third, fourth, fiveth)
    await bot.send_message(message.from_user.id, "Оберіть питання яке вас цікавить:\n"
                                                 f"Питання 1: {question1}\n\n"
                                                 f"Питання 2: {question2}\n\n"
                                                 f"Питання 3: {question3}\n\n"
                                                 f"Питання 4: {question4}\n\n"
                                                 f"Питання 5: {question5}\n\n", reply_markup=mar)


@dp.message_handler(text="Питання 1")
async def first_answer(message: types.Message):
    back = types.KeyboardButton("Назад🔙")
    # answer = types.KeyboardButton("Компенсація за піднайом.", web_app=types.WebAppInfo(url="https://wiki.legalaid.gov.ua/index.php/Компенсація_за_піднайом_(найом)_житла_для_військовослужбовців"))
    mar = types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1).add(back)
    await bot.send_message(message.from_user.id, """Розмір компенсації встановлений наказом Міноборони від 12 березня 2021 року № 59 «Про бюджетну політику Міністерства оборони України на 2021 рік». Так, з 1 січня 2021 року розмір виплати грошової компенсації військовослужбовцям ЗСУ за піднайом (найом) ними житлових приміщень встановлюється:\n\n
                                                            у місті Київ – 3800 грн на місяць;\n
                                                            в обласних центрах – 2850 грн на місяць;\n
                                                            в інших населених пунктах – 1900 грн на місяць.\n
                                                            При цьому військовослужбовцям за наявності в них трьох і більше членів сім'ї розмір компенсації збільшуються в 1,5 рази:\n\n
                                                            у місті Київ – 5700 грн на місяць;\n
                                                            в обласних центрах – 4275 грн на місяць;\n
                                                            в інших населених пунктах – 2850 грн на місяць.""", reply_markup=mar)


@dp.message_handler(text="Питання 2")
async def second_answer(message: types.Message):
    back = types.KeyboardButton("Назад🔙")
    # answer = types.KeyboardButton("Забезпечення жилими приміщеннями.", web_app=types.WebAppInfo(url="https://zakononline.com.ua/documents/show/372063___673360"))
    mar = types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1).add(back)
    await bot.send_message(message.from_user.id, """Житлові приміщення, які надаються військовослужбовцям для постійного проживання, мають відповідати встановленим санітарним і технічним вимогам.\n
                                                            Житлові приміщення надаються військовослужбовцям та членам їх сімей не менше рівня середньої забезпеченості громадян житловою площею, але не більше 13,65 квадратних метрів житлової площі на одну особу за умови, що ними не було використано право на безоплатну приватизацію житла.\n
                                                            У разі якщо військовослужбовець чи члени його сім’ї використали право на безоплатну приватизацію житла не в повному обсязі, при наданні житла враховується житлова площа у квартирі (будинку), яка знаходиться у приватній власності військовослужбовця або членів його сім’ї.\n
                                                            Під час надання житлових приміщень не допускається заселення однієї кімнати особами різної статі, старшими 9 років, крім подружжя, а також особами, що страждають тяжкими формами деяких хронічних захворювань, у зв’язку з чим вони не можуть проживати в одній кімнаті разом з членами своєї сім’ї, згідно з переліком хронічних захворювань, що затверджується центральним органом виконавчої влади, який формує державну політику у сфері охорони здоров’я.\n
                                                            Житлове приміщення може бути надано з перевищенням зазначеного в абзаці другому цього пункту розміру, якщо воно становить одну кімнату (однокімнатну квартиру) або у випадку, передбаченому в абзаці четвертому цього пункту.\n
                                                            Понад норми жилої площі окремим категоріям громадян надається додаткова жила площа у вигляді кімнати або 10 квадратних метрів житлової площі. Умови надання додаткової жилої площі та категорії громадян, які мають право на її одержання, встановлюються законодавством України.\n
                                                            При переданні військовослужбовцями та членами їх сімей житла, яке перебуває у їх приватній власності, до КЕУ, КЕВ (КЕЧ) району вони мають право на одержання від Міноборони житла у межах встановленої норми житлової площі.\n
                                                            У разі надходження кількох однокімнатних квартир з різною житловою площею пріоритетом під час розподілу таких квартир з розміром житлової площі понад 13,65 квадратних метра є надання такого житла сім’ї, а не одній особі.""", reply_markup=mar)


@dp.message_handler(text="Питання 3")
async def third_answer(message: types.Message):
    back = types.KeyboardButton("Назад🔙")
    # answer = types.KeyboardButton("Порядок забезпечення.", web_app=types.WebAppInfo(url="https://www.kmu.gov.ua/npas/43581369"))
    mar = types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1).add(back)
    await bot.send_message(message.from_user.id, """Для зарахування на облік військовослужбовець подає рапорт на ім’я безпосереднього командира (начальника).\n
                                                            До рапорту додаються:\n
                                                            довідка з місця проживання про реєстрацію і склад сім’ї;\n
                                                            витяг з особової справи військовослужбовця про склад сім'ї;\n
                                                            довідка про те, чи перебувають члени сім’ї на квартирному обліку за місцем роботи (у виконавчих органах місцевих рад);\n
                                                            документи, що підтверджують право на першочергове та позачергове одержання житла, інші пільги.\n
                                                            Інші документи житлова комісія запитує у разі потреби через командира військової частини у відповідних державних органів, установ, організацій, громадян.""", reply_markup=mar)


@dp.message_handler(text="Питання 4")
async def fourth_answer(message: types.Message):
    back = types.KeyboardButton("Назад🔙")
    # answer = types.KeyboardButton("Компенсація за піднайом.", web_app=types.WebAppInfo(
    #     url="https://wiki.legalaid.gov.ua/index.php/Компенсація_за_піднайом_(найом)_житла_для_військовослужбовців"))
    mar = types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1).add(back)
    await bot.send_message(message.from_user.id, """копії документів, що посвідчують особу та підтверджують громадянство України військовослужбовця та членів його сім’ї;\n
                                                            копії документів, що засвідчують реєстрацію в Державному реєстрі фізичних осіб - платників податків (крім осіб, які через свої релігійні переконання відмовляються від прийняття реєстраційного номера облікової картки платника податків та повідомили про це відповідному контролюючому органу і мають відмітку в паспорті) військовослужбовця та членів його сім’ї;\n
                                                            інформацію (витяг, інформаційну довідку) з Державного реєстру речових прав на нерухоме майно та бюро технічної інвентаризації про нерухоме майно, яке належить військовослужбовцю та членам його сім’ї;\n
                                                            копії довідок про реєстрацію місця проживання (перебування), видані органом реєстрації, на військовослужбовця та кожного члена його сім’ї, який проживає разом з ним (військовослужбовці військових частин, які дислокувалися в населених пунктах, на території яких органи державної влади тимчасово не здійснюють свої повноваження, і які переміщені з місць попередньої дислокації, подають довідку про склад сім’ї, видану командиром (начальником) цієї військової частини (підрозділу);\n
                                                            копії свідоцтв про державну реєстрацію актів цивільного стану (про шлюб, розірвання шлюбу, про народження тощо), інших документів, що підтверджують родинні стосунки;\n
                                                            належним чином завірену копію довідки про забезпечення житлом з попереднього місця проходження військової служби, видану квартирно-експлуатаційним органом (службою) Міноборони, Національної гвардії, відповідним підрозділом СБУ, розвідувальними органами, Держприкордонслужби, Держспецзв’язку, Держспецтрансслужби, МОН, ДКА, Управління державної охорони (крім осіб, які прибули з тимчасово окупованої території України та населених пунктів, на території яких органи державної влади тимчасово не здійснюють свої повноваження).\n
                                                            Поряд із грошовою компенсацією за піднайом житла пересічний військовослужбовець може отримувати і кошти за оренду житла (на його вибір). Проєкт договору оренди житла розробляється військовою частиною, погоджується квартирно-експлуатаційними органами та після його укладення реєструється у військовій частині. Він зберігається у фінансовій службі частини та є підставою для оплати оренди житла. Оплата оренди житла здійснюється за місцем проходження військової служби або за місцем виплати грошового забезпечення в безготівковій формі.""", reply_markup=mar)


@dp.message_handler(text="Питання 5")
async def fiveth_answer(message: types.Message):
    back = types.KeyboardButton("Назад🔙")
    # answer = types.KeyboardButton("Порядок забезпечення.", web_app=types.WebAppInfo(url="https://www.kmu.gov.ua/npas/43581369"))
    mar = types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1).add(back)
    await bot.send_message(message.from_user.id, """Військовослужбовці знімаються з обліку у разі:\n
                                                            поліпшення житлових умов, внаслідок чого відпала потреба в наданні житла;\n
                                                            засудження військовослужбовця до позбавлення волі на строк понад шість місяців, крім умовного засудження;\n
                                                            звільнення з військової служби за службовою невідповідністю, у зв’язку з систематичним невиконанням умов контракту військовослужбовцем;\n
                                                            подання відомостей, що не відповідають дійсності, але стали підставою для зарахування на облік;\n
                                                            в інших випадках, передбачених законодавством.""", reply_markup=mar)


if __name__ == "__main__":
    executor.start_polling(dp)